lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE9x.svd
        <!-- HS_CONTROL-->
        <register>
          <name>HS_CONTROL</name>
          <description>HSE Generator Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #RST_HS_RMASK -->
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>HSE_ON</name>
              <description>HSE Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__HS__HSE_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>HSE Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>HSE On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_BYP</name>
              <description>HSE Bypass Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__HS__HSE_BYP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>HSE forms Clock from external oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>HSE passes Clock from external generator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #RST_HS_HSE2 -->
            <!-- HS_CONTROL fields end -->
          </fields>
        </register>
        <!-- CPU_CLOCK -->
        <register>
          <name>CPU_CLOCK</name>
          <description>CPU Clock Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003F7</resetMask>
          <fields>
            <!-- CPU_CLOCK.CPU_C1_SEL -->
            <field>
              <name>CPU_C1_SEL</name>
              <description>CPU_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__C1_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>CPU_C1 output is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_DIV2</name>
                  <description>CPU_C1 output is HSI/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>CPU_C1 output is HSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV2</name>
                  <description>CPU_C1 output is HSE/2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK.CPU_C2_SEL -->
            <field>
              <name>CPU_C2_SEL</name>
              <description>CPU_C2 mux freq select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__C2_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>Freq from CPU_C1 mux direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>Freq from CPU_C1 mux through PLL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK.CPU_C3_SEL -->
            <field>
              <name>CPU_C3_SEL</name>
              <description>CPU_C2 mux output freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__C3_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>div256</name><description>div by 256</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK.HCLK_SEL -->
            <field>
              <name>HCLK_SEL</name>
              <description>Select Clock for CPU</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__CPU__HCLK_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>CPU clock is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_C3</name>
                  <description>CPU clock is CPU_C3 output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>CPU clock is LSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>CPU clock is LSI</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- CPU_CLOCK fields end-->
          </fields>
        </register>
        <!-- #RST_REG_USB_CLOCK -->
        <register>
          <name>USB_CLOCK</name>
          <description>USB Clock Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000117</resetMask>
          <fields>
            <!-- USB_CLOCK.USB_C1_SEL -->
            <field>
              <name>USB_C1_SEL</name>
              <description>USB_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__C1_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>USB_C1 output is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_DIV2</name>
                  <description>USB_C1 output is HSI/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>USB_C1 output is HSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV2</name>
                  <description>USB_C1 output is HSE/2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK.USB_C2_SEL -->
            <field>
              <name>USB_C2_SEL</name>
              <description>USB_C2 mux freq select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__C2_</headerEnumName>
                <enumeratedValue>
                  <name>USB_C1</name>
                  <description>Freq from CPU_C1 mux direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLUSBo</name>
                  <description>Freq from CPU_C1 mux through PLL_USB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK.USB_C3_SEL -->
            <field>
              <name>USB_C3_SEL</name>
              <description>USB_C3 Input Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__C3_</headerEnumName>
                <enumeratedValue>
                  <name>USB_C2</name>
                  <description>C3 Input is freq from C2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_C2_div2</name>
                  <description>C3 Input is freq from C2/2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK.USB_EN -->
            <field>
              <name>USB_EN</name>
              <description>USB Clock Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__USB__CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- USB_CLOCK fields end-->
          </fields>
        </register>
        <!-- #RST_REG_PER1 -->
        <!-- #RST_REG_ADC -->
        <register>
          <name>ADC_CLOCK</name>
          <description>ADC Clock Control</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ADC_RMASK --> 
          <resetMask>0x00002F33</resetMask>
          <fields>
            <!-- ADC_CLOCK.ADC_C1_SEL -->
            <field>
              <name>ADC_C1_SEL</name>
              <description>ADC_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__C1_</headerEnumName>
                <enumeratedValue>
                  <name>CPU_C1</name>
                  <description>ADC_C1 output is CPU_C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_C1</name>
                  <description>ADC_C1 output is USB_C1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_C2</name>
                  <description>ADC_C1 output is CPU_C2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_C2</name>
                  <description>ADC_C1 output is USB_C2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADC_C2_SEL -->
            <field>
              <name>ADC_C2_SEL</name>
              <description>ADC_C2 mux freq select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__C2_</headerEnumName>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>ADC_C2 output is LSE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>ADC_C2 output is LSI</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_C1</name>
                  <description>ADC_C2 output is ADC_C1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_C1</name>
                  <description>ADC_C2 output is HSI_C1</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- ADC_CLOCK.ADC_C3_SEL -->
            <field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>ADC_C3_SEL</name>
              <description>ADC_C2 mux output freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ADC_CLOCK.ADC_CLK_EN -->
            <field>
              <name>ADC_CLK_EN</name>
              <description>ADC Clock Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ADC__CLK_EN_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>ADC clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>ADC clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ADC_AUC_C1 -->
            <!-- #ADC_AUC_C2 -->
            <!-- #ADC_AUC_C3 -->
            <!-- #ADC_AUC_EN -->
            <!-- ADC_CLOCK fields end-->
          </fields>
        </register>
        <!-- RTC_CLOCK-->
        <register>
          <name>RTC_CLOCK</name>
          <description>RTC Clock Control</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <!-- RTC_CLOCK.HSE_SEL -->
            <field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>HSE_SEL</name>
              <description>RTC HSE freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- RTC_CLOCK.HSI_SEL -->
            <field derivedFrom="MDR_RST_CLOCK.CPU_CLOCK.CPU_C3_SEL">
              <name>HSI_SEL</name>
              <description>RTC HSI freq devider, [/1, /2, /4 .. /256]</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>            
            <!-- RTC_CLOCK.HSE_RTC_EN -->
            <field>
              <name>HSE_RTC_EN</name>
              <description>RTC HSE Clock enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__RTC__HSE_RTC_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>RTC HSE Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>RTC HSE Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- RTC_CLOCK.HSI_RTC_EN -->
            <field>
              <name>HSI_RTC_EN</name>
              <description>RTC HSI Clock enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__RTC__HSI_RTC_CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>RTC HSI Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>RTC HSI Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- RTC_CLOCK fields end-->
          </fields>
        </register>        
