lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE9x.svd
        <!-- #RST_REG_DSP_CLOCK -->
        <!-- #RST_REG_ETH_CLOCK -->
        <!-- #RST_REG_SSP2 -->
        <!-- #RST_REG_PER2 -->
        <!-- #RST_REG_DSP_CTRL -->
        <!-- #RST_REG_UARTSSP -->
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #DMA -->
    <!-- DMA -->
    <peripheral>
      <name>MDR_DMA</name>
      <version>1.0</version>
      <description>DMA Controler</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40028000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- STATUS -->
        <register>
          <name>STATUS</name>
          <description>Status register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0xF01F0F01</resetMask>
          <fields>
            <field>
              <name>Enable</name>
              <description>Enable block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Block inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Block active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>State</name>
              <description>Active Operation</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Idle</name><description>Idle state</description>                         <value>0</value></enumeratedValue>
                <enumeratedValue><name>RD_Ctrl</name><description>Reading channel controller data</description> <value>1</value></enumeratedValue>
                <enumeratedValue><name>RD_pSrc</name><description>Reading source data end pointer</description> <value>2</value></enumeratedValue>
                <enumeratedValue><name>RD_pDest</name><description>Reading destination data end pointer</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>RD_Data</name><description>Reading source data</description>             <value>4</value></enumeratedValue>
                <enumeratedValue><name>WR_Data</name><description>writing destination data</description>        <value>5</value></enumeratedValue>
                <enumeratedValue><name>Wait_Clr</name><description>Waiting for DMA request to clear</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>WR_Ctrl</name><description>Writing channel controller data</description> <value>7</value></enumeratedValue>
                <enumeratedValue><name>Stalled</name><description>Stalled transfer</description>                <value>8</value></enumeratedValue>
                <enumeratedValue><name>Done</name><description>Done transfer</description>                      <value>9</value></enumeratedValue>
                <enumeratedValue><name>ScatGath</name><description>scatter-gather transition</description>      <value>10</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Chnls_minus1</name>
              <description>Channels count</description>
              <bitRange>[20:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>1_channels</name><description>Channels Count</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>2_channels</name><description>Channels Count</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>3_channels</name><description>Channels Count</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>4_channels</name><description>Channels Count</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>5_channels</name><description>Channels Count</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>6_channels</name><description>Channels Count</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>7_channels</name><description>Channels Count</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>8_channels</name><description>Channels Count</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>9_channels</name><description>Channels Count</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>10_channels</name><description>Channels Count</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>11_channels</name><description>Channels Count</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>12_channels</name><description>Channels Count</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>13_channels</name><description>Channels Count</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>14_channels</name><description>Channels Count</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>15_channels</name><description>Channels Count</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>16_channels</name><description>Channels Count</description><value>15</value></enumeratedValue>
                <enumeratedValue><name>17_channels</name><description>Channels Count</description><value>16</value></enumeratedValue>
                <enumeratedValue><name>18_channels</name><description>Channels Count</description><value>17</value></enumeratedValue>
                <enumeratedValue><name>19_channels</name><description>Channels Count</description><value>18</value></enumeratedValue>
                <enumeratedValue><name>20_channels</name><description>Channels Count</description><value>19</value></enumeratedValue>
                <enumeratedValue><name>21_channels</name><description>Channels Count</description><value>20</value></enumeratedValue>
                <enumeratedValue><name>22_channels</name><description>Channels Count</description><value>21</value></enumeratedValue>
                <enumeratedValue><name>23_channels</name><description>Channels Count</description><value>22</value></enumeratedValue>
                <enumeratedValue><name>24_channels</name><description>Channels Count</description><value>23</value></enumeratedValue>
                <enumeratedValue><name>25_channels</name><description>Channels Count</description><value>24</value></enumeratedValue>
                <enumeratedValue><name>26_channels</name><description>Channels Count</description><value>25</value></enumeratedValue>
                <enumeratedValue><name>27_channels</name><description>Channels Count</description><value>26</value></enumeratedValue>
                <enumeratedValue><name>28_channels</name><description>Channels Count</description><value>27</value></enumeratedValue>
                <enumeratedValue><name>29_channels</name><description>Channels Count</description><value>28</value></enumeratedValue>
                <enumeratedValue><name>30_channels</name><description>Channels Count</description><value>29</value></enumeratedValue>
                <enumeratedValue><name>31_channels</name><description>Channels Count</description><value>30</value></enumeratedValue>
                <enumeratedValue><name>32_channels</name><description>Channels Count</description><value>31</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>test_status</name>
              <description>Test logic availability</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Unavailable</name><description>Test logic unavailable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Available</name><description>Test logic available</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>  
        </register>
        <!-- CFG -->
        <register>
          <name>CFG</name>
          <description>Config register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x000000E1</resetMask>
          <fields>
            <field>
              <name>Enable</name>
              <description>Enable block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Block inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Block active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Privileged</name>
              <description>Privileged AHB bus priority</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="Privileged">
              <name>Bufferable</name>
              <description>Bufferable AHB bus priority</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="Privileged">
              <name>Cachable</name>
              <description>Cachable AHB bus priority</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>  
        </register>
