lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE9x.svd
        <!-- ADC2_Cfg -->
        <register>
          <name>ADC2_Cfg</name>
          <description>ADC2 config register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ADC2_RMASK -->
          <resetMask>0x0E06FFFF</resetMask>
          <fields>
            <!-- #ADC2_CFG_VE9x_start -->
            <field derivedFrom="MDR_ADC.ADC1_Cfg.ADON">
              <name>ADON</name>
              <description>Enable ADC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.GO">
              <name>GO</name>
              <description>Start single ADC mesurement</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.CLKS">
              <name>CLKS</name>
              <description>Select Clock</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.SAMPLE">
              <name>SAMPLE</name>
              <description>Single or Continuous measurement</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.CHS">
              <name>CHS</name>
              <description>Active channel select</description>
              <bitRange>[8:4]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.CHCH">
              <name>CHCH</name>
              <description>Channel switching enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.RGNC">
              <name>RGNC</name>
              <description>Signal limiters enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.M_REF">
              <name>REF</name>
              <description>Signal amplitude reference</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.DIV_CLK">
              <name>CLKS</name>
              <description>Divider for CPU_Clock usage</description>
              <bitRange>[15:12]</bitRange>
            </field>

            <field>
              <name>ADC1_OP</name>
              <description>ADC1 Setpoint Vref source</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Own</name>
                  <description>Own setpoint Vref</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Thermosensor</name>
                  <description>Setpoint Vref from Thermosensor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ADC2_CFG_VE9x_end -->
            <field derivedFrom="ADC1_OP">
              <name>ADC2_OP</name>
              <description>ADC2 Setpoint Vref source</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="MDR_ADC.ADC1_Cfg.Delay_GO">
              <name>Delay_GO</name>
              <description>Delay after channels switching in CPU_CLK</description>
              <bitRange>[27:25]</bitRange>
            </field>
          </fields>
        </register>
        <!-- ADC1_H_Level -->
        <register>
          <name>ADC1_H_Level</name>
          <description>ADC High limit</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>Level</name>
              <description>Signal limit level</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>        
          </fields>
        </register>      
        <!-- #ADC2_H_LIM -->
        <register derivedFrom="MDR_ADC.ADC1_H_Level">
          <name>ADC2_H_Level</name>
          <addressOffset>0x0000000C</addressOffset>
        </register>
        <!-- ADC1_L_Level -->
        <register derivedFrom="ADC1_H_Level">
          <name>ADC1_L_Level</name>
          <description>ADC Low limit</description>
          <addressOffset>0x00000010</addressOffset>
        </register>
        <!-- #ADC2_L_LIM -->
        <register derivedFrom="MDR_ADC.ADC1_H_Level">
          <name>ADC2_L_Level</name>
          <addressOffset>0x00000014</addressOffset>
        </register>
        <!-- ADC1_Result -->
        <register>
          <name>ADC1_RESULT</name>
          <description>ADC result register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0FFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Channel signal value</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>Channel</name>
              <description>Channel index</description>
              <bitRange>[20:16]</bitRange>
              <enumeratedValues>
                <!-- #ADC1_CHS -->
                <enumeratedValue><name>Channel_0_RefP</name><description>Signal on PD0, Ref+</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Channel_1_RefN</name><description>Signal on PD1, Ref-</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Channel_2</name><description>Signal on PD2</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Channel_3</name><description>Signal on PD3</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Channel_4</name><description>Signal on PD4</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Channel_5</name><description>Signal on PD5</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Channel_6</name><description>Signal on PD6</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Channel_7</name><description>Signal on PD7</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Channel_8</name><description>Signal on PD8</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>Channel_9</name><description>Signal on PD9</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>Channel_10</name><description>Signal on PD10</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>Channel_11</name><description>Signal on PD11</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>Channel_12</name><description>Signal on PD12</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>Channel_13</name><description>Signal on PD13</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>Channel_14</name><description>Signal on PD14</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>Channel_15</name><description>Signal on PD15</description><value>15</value></enumeratedValue>
                <enumeratedValue><name>TS_VRef_1.23</name><description>Signal from Thermosensor</description><value>30</value></enumeratedValue>
                <enumeratedValue><name>TS_Temperature</name><description>Signal from Thermosensor</description><value>31</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- #ADC2_Result -->
        <register derivedFrom="MDR_ADC.ADC1_RESULT">
          <name>ADC2_RESULT</name>
          <addressOffset>0x0000001C</addressOffset>
        </register>
        <!-- ADC1_Status -->
        <register>
          <name>ADC1_STATUS</name>
          <description>ADC status register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>Overwrite</name>
              <description>Result overwritten flag</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>No overwritten occure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Overwrite</name>
                  <description>Result overwritten</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWOIFEN</name>
              <description>Signal is out of limiters range</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InRange</name>
                  <description>Signal in range</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OutOfRange</name>
                  <description>Signal is out of range</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOCIF</name>
              <description>Result ready to read</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoResult</name>
                  <description>Result is not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Signal is ready to read</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWOIF_IE</name>
              <description>Enable IRQ by AWOIFEN flag</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>IRQ Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>IRQ Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="AWOIF_IE">
              <name>EOCIF_EN</name>
              <description>Enable IRQ by EOCIF flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>    
        <!-- #ADC2_Status -->
        <register derivedFrom="MDR_ADC.ADC1_STATUS">
          <name>ADC2_STATUS</name>
          <addressOffset>0x00000024</addressOffset>
        </register>
