lamer0k/CortexLib/Tools/RegistersGenerator/MDR1986VE9x.svd
        <!-- ADC1_CHSEL -->
        <register>
          <name>ADC1_CHSEL</name>
          <description>ADC channels select register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ADC1_CHSEL_RMASK -->
          <resetMask>0xC000FFFF</resetMask>
          <fields>
            <!-- #ADC1_CHSEL_ITEMS -->
            <field><name>Channel_0</name><description>Signal on PD7, Ref+</description><bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Not used in channels switching</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Selected</name><description>Using in channels switching</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="Channel_0"><name>Channel_1</name><description>Signal on PD8, Ref-</description><bitRange>[1:1]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_2</name><description>Signal on PD9</description><bitRange>[2:2]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_3</name><description>Signal on PD10</description><bitRange>[3:3]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_4</name><description>Signal on PD11</description><bitRange>[4:4]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_5</name><description>Signal on PD12</description><bitRange>[5:5]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_6</name><description>Signal on PD13</description><bitRange>[6:6]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_7</name><description>Signal on PD14</description><bitRange>[7:7]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_8</name><description>Signal on PD9</description><bitRange>[8:8]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_9</name><description>Signal on PD10</description><bitRange>[9:9]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_10</name><description>Signal on PD11</description><bitRange>[10:10]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_11</name><description>Signal on PD12</description><bitRange>[11:11]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_12</name><description>Signal on PD13</description><bitRange>[12:12]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_13</name><description>Signal on PD14</description><bitRange>[13:13]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_14</name><description>Signal on PD11</description><bitRange>[14:14]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_15</name><description>Signal on PD12</description><bitRange>[15:15]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_30</name><description>VRef from Thermosensor</description><bitRange>[30:30]</bitRange></field>
            <field derivedFrom="Channel_0"><name>Channel_31</name><description>Temperature from Thermosensor</description><bitRange>[31:31]</bitRange></field>
          </fields>    
        </register>
        <!-- #ADC2_REG_CHSEL -->    
        <register derivedFrom="MDR_ADC.ADC1_CHSEL">
          <name>ADC2_CHSEL</name>
          <addressOffset>0x0000002C</addressOffset>
        </register>
        <!-- #ADC1_REG_TRIM -->
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #DAC -->
    <!-- #COMP -->
    <!-- #BKP -->
    <!-- BKP and RTC -->
    <peripheral>
      <name>MDR_BKP</name>
      <version>1.0</version>
      <description>Backup and RTC Control</description>
      <groupName>BKP and RTC</groupName>
      <!-- #BKP_ADDR -->
      <baseAddress>0x400D8000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- REG_x -->
        <register>
          <dim>14</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,A,B,C,D</dimIndex>
          <name>REG_0%s</name>
          <description>User backup registers</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REG_0E -->
        <register>
          <name>REG_0E</name>
          <description>REG_OE Control register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #BKP_RESMSK -->
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <!--LOW-->
            <field>
              <name>LOW</name>
              <description>DUcc Freq control</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__LOW_</headerEnumName>
                <enumeratedValue>
                  <name>10MHz</name>
                  <description>CPU Clock less then 10MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200KHz</name>
                  <description>CPU Clock less then 200KHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHz</name>
                  <description>CPU Clock less then 500KHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>CPU Clock less then 1MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GensOffz</name>
                  <description>Generators Off</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40MHz</name>
                  <description>CPU Clock less then 40MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80MHz</name>
                  <description>CPU Clock less then 80MHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>above_80MHz</name>
                  <description>CPU Clock above 10MHz</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--SelectRI-->
            <field>
              <name>SelectRI</name>
              <description>DUcc extra I, should be equals to LOW field!</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__SelRI_</headerEnumName>
                <enumeratedValue>
                  <name>10MHz</name>
                  <description>Additional I ~ 300uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200KHz</name>
                  <description>Additional I ~ 6.6uA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHz</name>
                  <description>Additional I ~ 20A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>Additional I ~ 80uA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GensOffz</name>
                  <description>Additional I ~ 2uA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40MHz</name>
                  <description>Additional I ~ 900uA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80MHz</name>
                  <description>Additional I ~ 4.4mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>above_80MHz</name>
                  <description>Additional I ~ 19mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_ALONE -->
            <!-- #BKP_JTAGA -->
            <field>
              <name>Jtag_A</name>
              <description>Enable Jtag_A interface</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__JtagA_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_JTAGB -->
            <field>
              <name>Jtag_B</name>
              <description>Enable Jtag_B interface</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__JtagB_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--Trim dDUcc-->
            <field>
              <name>Trim_dDUcc</name>
              <description>Ducc adjust voltages</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__dDUcc_</headerEnumName>
                <enumeratedValue>
                  <name>+0.1</name>
                  <description>DUcc += 0.1 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.06</name>
                  <description>DUcc += 0.06 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.04</name>
                  <description>DUcc += 0.04 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.01</name>
                  <description>DUcc += 0.01 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.01</name>
                  <description>DUcc -= 0.01 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.04</name>
                  <description>DUcc -= 0.04 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.6</name>
                  <description>DUcc -= 0.06 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.1</name>
                  <description>DUcc -= 0.1 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--FPOR-->
            <field>
              <name>FPOR</name>
              <description>Power Reset Flag</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__FPOR_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>No Bootloader</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Bootloader completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_TRIM_DU -->
            <!-- #BKP_COVDET -->
            <!-- #BKP_MODE -->
            <field>
              <name>MODE</name>
              <description>Bootloading Mode</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__MODE_</headerEnumName>
                <enumeratedValue>
                  <name>IntFlash_JtagB</name>
                  <description>Execute from internal flash with Jtag_B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IntFlash_JtagA</name>
                  <description>Execute from internal flash with Jtag_A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExtMem_JtagB</name>
                  <description>Execute from external memory with Jtag_B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExtMem_JtagOff</name>
                  <description>Execute from external memory without any Jtag</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Uart_PD01</name>
                  <description>Uart bootloader, pins PD[1:0]</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Uart_PF01</name>
                  <description>Uart bootloader, pins PF[1:0]</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_LimI -->
          </fields>
        </register>
